opentx/opentx/src/act/STM32F10x_StdPeriph_Lib_V3.5.0/Utilities/STM32_EVAL/STM32100B_EVAL/stm32100b_eval_lcd.c
    /* Chip Set --------------------------------------------------------------*/
    LCD_WriteReg(LCD_REG_157, 0x00);
    LCD_WriteReg(LCD_REG_192, 0x00);
   
    LCD_WriteReg(LCD_REG_14, 0x00);
    LCD_WriteReg(LCD_REG_15, 0x00);
    LCD_WriteReg(LCD_REG_16, 0x00);
    LCD_WriteReg(LCD_REG_17, 0x00);
    LCD_WriteReg(LCD_REG_18, 0x00);
    LCD_WriteReg(LCD_REG_19, 0x00);
    LCD_WriteReg(LCD_REG_20, 0x00);
    LCD_WriteReg(LCD_REG_21, 0x00);
    LCD_WriteReg(LCD_REG_22, 0x00);
    LCD_WriteReg(LCD_REG_23, 0x00);
   
    LCD_WriteReg(LCD_REG_52, 0x01);
    LCD_WriteReg(LCD_REG_53, 0x00);
    LCD_WriteReg(LCD_REG_75, 0x00);
    LCD_WriteReg(LCD_REG_76, 0x00);
    LCD_WriteReg(LCD_REG_78, 0x00);
    LCD_WriteReg(LCD_REG_79, 0x00);
    LCD_WriteReg(LCD_REG_80, 0x00);
  
    LCD_WriteReg(LCD_REG_60, 0x00);
    LCD_WriteReg(LCD_REG_61, 0x00);
    LCD_WriteReg(LCD_REG_62, 0x01);
    LCD_WriteReg(LCD_REG_63, 0x3F);
    LCD_WriteReg(LCD_REG_64, 0x02);
    LCD_WriteReg(LCD_REG_65, 0x02);
    LCD_WriteReg(LCD_REG_66, 0x00);
    LCD_WriteReg(LCD_REG_67, 0x00);
    LCD_WriteReg(LCD_REG_68, 0x00);
    LCD_WriteReg(LCD_REG_69, 0x00);
    LCD_WriteReg(LCD_REG_70, 0xEF);
    LCD_WriteReg(LCD_REG_71, 0x00);
    LCD_WriteReg(LCD_REG_72, 0x00);
    LCD_WriteReg(LCD_REG_73, 0x01);
    LCD_WriteReg(LCD_REG_74, 0x3F);
  
    LCD_WriteReg(LCD_REG_29, 0x08);  /* R29:Gate scan direction setting */
  
    LCD_WriteReg(LCD_REG_134, 0x00);
    LCD_WriteReg(LCD_REG_135, 0x30);
    LCD_WriteReg(LCD_REG_136, 0x02);
    LCD_WriteReg(LCD_REG_137, 0x05);
  
    LCD_WriteReg(LCD_REG_141, 0x01);  /* R141:Register set-up mode for one line clock */
    LCD_WriteReg(LCD_REG_139, 0x20);  /* R139:One line SYSCLK number in one-line */
    LCD_WriteReg(LCD_REG_51, 0x01);  /* R51:N line inversion setting */
    LCD_WriteReg(LCD_REG_55, 0x01);  /* R55:Scanning method setting */
    LCD_WriteReg(LCD_REG_118, 0x00);
   
    /* Gamma Set -------------------------------------------------------------*/
    LCD_WriteReg(LCD_REG_143, 0x10);
    LCD_WriteReg(LCD_REG_144, 0x67);
    LCD_WriteReg(LCD_REG_145, 0x07);
    LCD_WriteReg(LCD_REG_146, 0x65);
    LCD_WriteReg(LCD_REG_147, 0x07);
    LCD_WriteReg(LCD_REG_148, 0x01);
    LCD_WriteReg(LCD_REG_149, 0x76);
    LCD_WriteReg(LCD_REG_150, 0x56);
    LCD_WriteReg(LCD_REG_151, 0x00);
    LCD_WriteReg(LCD_REG_152, 0x06);
    LCD_WriteReg(LCD_REG_153, 0x03);
    LCD_WriteReg(LCD_REG_154, 0x00);
  
    /* Display On ------------------------------------------------------------*/
    LCD_WriteReg(LCD_REG_1, 0x50);
    LCD_WriteReg(LCD_REG_5, 0x04);
    LCD_WriteReg(LCD_REG_0, 0x80);
    LCD_WriteReg(LCD_REG_59, 0x01);
    _delay_(4);  /* Delay 40 ms */
    LCD_WriteReg(LCD_REG_0, 0x20);
  }  
}


/**
  * @brief  Initializes the LCD.
  * @param  None
  * @retval None
  */
void STM32100B_LCD_Init(void)
{
  /* Setups the LCD */
  LCD_Setup();
  /* Try to read new LCD controller ID 0x9320 */
  if (LCD_ReadReg(LCD_REG_0) == LCD_ILI9320)
  {
    LCDType = LCD_ILI9320;
  }
  else
  {
    LCDType = LCD_SPFD5408;
    /* Setups the LCD */
    LCD_Setup();
    /* Try to read new LCD controller ID 0x5408 */
    if (LCD_ReadReg(LCD_REG_0) != LCD_SPFD5408)
    {
      LCDType = LCD_HX8312;
      /* Setups the LCD */
      LCD_Setup();
    }
  }
  LCD_SetFont(&LCD_DEFAULT_FONT);
}

/**
  * @brief  Sets the LCD Text and Background colors.
  * @param  _TextColor: specifies the Text Color.
  * @param  _BackColor: specifies the Background Color.
  * @retval None
  */
void LCD_SetColors(__IO uint16_t _TextColor, __IO uint16_t _BackColor)
{
  TextColor = _TextColor; 
  BackColor = _BackColor;
}

/**
  * @brief  Gets the LCD Text and Background colors.
  * @param  _TextColor: pointer to the variable that will contain the Text 
            Color.
  * @param  _BackColor: pointer to the variable that will contain the Background 
            Color.
  * @retval None
  */
void LCD_GetColors(__IO uint16_t *_TextColor, __IO uint16_t *_BackColor)
{
  *_TextColor = TextColor; *_BackColor = BackColor;
}

/**
  * @brief  Sets the Text color.
  * @param  Color: specifies the Text color code RGB(5-6-5).
  * @retval None
  */
void LCD_SetTextColor(__IO uint16_t Color)
{
  TextColor = Color;
}


/**
  * @brief  Sets the Background color.
  * @param  Color: specifies the Background color code RGB(5-6-5).
  * @retval None
  */
void LCD_SetBackColor(__IO uint16_t Color)
{
  BackColor = Color;
}

/**
  * @brief  Sets the Text Font.
  * @param  fonts: specifies the font to be used.
  * @retval None
  */
void LCD_SetFont(sFONT *fonts)
{
  LCD_Currentfonts = fonts;
}

/**
  * @brief  Gets the Text Font.
  * @param  None.
  * @retval the used font.
  */
sFONT *LCD_GetFont(void)
{
  return LCD_Currentfonts;
}

/**
  * @brief  Clears the selected line.
  * @param  Line: the Line to be cleared.
  *   This parameter can be one of the following values:
  *     @arg Linex: where x can be 0..n
  * @retval None
  */
void LCD_ClearLine(uint8_t Line)
{
  uint16_t refcolumn = LCD_PIXEL_WIDTH - 1;
  /* Send the string character by character on lCD */
  while (((refcolumn + 1) & 0xFFFF) >= LCD_Currentfonts->Width)
  {
    /* Display one character on LCD */
    LCD_DisplayChar(Line, refcolumn, ' ');
    /* Decrement the column position by 16 */
    refcolumn -= LCD_Currentfonts->Width;
  }
}


/**
  * @brief  Clears the hole LCD.
  * @param  Color: the color of the background.
  * @retval None
  */
void LCD_Clear(uint16_t Color)
{
  uint32_t index = 0;
  
  LCD_SetCursor(0x00, 0x013F); 
  if((LCDType == LCD_ILI9320) || (LCDType == LCD_SPFD5408))
  {
    LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */
  }
  for(index = 0; index < 76800; index++)
  {
    LCD_WriteRAM(Color);
  }
  if((LCDType == LCD_ILI9320) || (LCDType == LCD_SPFD5408))
  {
    LCD_CtrlLinesWrite(LCD_NCS_GPIO_PORT, LCD_NCS_PIN, Bit_SET); 
  }  
}


/**
  * @brief  Sets the cursor position.
  * @param  Xpos: specifies the X position.
  * @param  Ypos: specifies the Y position. 
  * @retval None
  */
void LCD_SetCursor(uint8_t Xpos, uint16_t Ypos)
{
  if((LCDType == LCD_ILI9320) || (LCDType == LCD_SPFD5408))
  {
    LCD_WriteReg(LCD_REG_32, Xpos);
    LCD_WriteReg(LCD_REG_33, Ypos);
  }
  else if(LCDType == LCD_HX8312)
  {
    LCD_WriteReg(LCD_REG_66, Xpos);
    LCD_WriteReg(LCD_REG_67, ((Ypos & 0x100)>> 8));
    LCD_WriteReg(LCD_REG_68, (Ypos & 0xFF));
  }
}


/**
  * @brief  Draws a character on LCD.
  * @param  Xpos: the Line where to display the character shape.
  * @param  Ypos: start column address.
  * @param  c: pointer to the character data.
  * @retval None
  */
void LCD_DrawChar(uint8_t Xpos, uint16_t Ypos, const uint16_t *c)
{
  uint32_t index = 0, i = 0;
  uint8_t Xaddress = 0;
   
  Xaddress = Xpos;
  
  LCD_SetCursor(Xaddress, Ypos);
  
  for(index = 0; index < LCD_Currentfonts->Height; index++)
  {
    if((LCDType == LCD_ILI9320) || (LCDType == LCD_SPFD5408))
    {
      LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */
    }
    for(i = 0; i < LCD_Currentfonts->Width; i++)
    {
      if((((c[index] & ((0x80 << ((LCD_Currentfonts->Width / 12 ) * 8 ) ) >> i)) == 0x00) &&(LCD_Currentfonts->Width <= 12))||
        (((c[index] & (0x1 << i)) == 0x00)&&(LCD_Currentfonts->Width > 12 )))

      {
        LCD_WriteRAM(BackColor);
      }
      else
      {
        LCD_WriteRAM(TextColor);
      }
    }
    if((LCDType == LCD_ILI9320) || (LCDType == LCD_SPFD5408))
    {
      LCD_CtrlLinesWrite(LCD_NCS_GPIO_PORT, LCD_NCS_PIN, Bit_SET);
    }  
    Xaddress++;
    LCD_SetCursor(Xaddress, Ypos);
  }
}


/**
  * @brief  Displays one character (16dots width, 24dots height).
  * @param  Line: the Line where to display the character shape .
  *   This parameter can be one of the following values:
  *     @arg Linex: where x can be 0..9
  * @param  Column: start column address.
  * @param  Ascii: character ascii code, must be between 0x20 and 0x7E.
  * @retval None
  */
void LCD_DisplayChar(uint8_t Line, uint16_t Column, uint8_t Ascii)
{
  Ascii -= 32;
  LCD_DrawChar(Line, Column, &LCD_Currentfonts->table[Ascii * LCD_Currentfonts->Height]);
}


/**
  * @brief  Displays a maximum of 20 char on the LCD.
  * @param  Line: the Line where to display the character shape .
  *   This parameter can be one of the following values:
  *     @arg Linex: where x can be 0..9
  * @param  *ptr: pointer to string to display on LCD.
  * @retval None
  */
void LCD_DisplayStringLine(uint8_t Line, uint8_t *ptr)
{
  uint16_t refcolumn = LCD_PIXEL_WIDTH - 1;

  /* Send the string character by character on lCD */
  while ((*ptr != 0) & (((refcolumn + 1) & 0xFFFF) >= LCD_Currentfonts->Width))
  {
    /* Display one character on LCD */
    LCD_DisplayChar(Line, refcolumn, *ptr);
    /* Decrement the column position by 16 */
    refcolumn -= LCD_Currentfonts->Width;
    /* Point on the next character */
    ptr++;
  }
}


/**
  * @brief  Sets a display window
  * @param  Xpos: specifies the X buttom left position.
  * @param  Ypos: specifies the Y buttom left position.
  * @param  Height: display window height.
  * @param  Width: display window width.
  * @retval None
  */
void LCD_SetDisplayWindow(uint8_t Xpos, uint16_t Ypos, uint8_t Height, uint16_t Width)
{
  if((LCDType == LCD_ILI9320) || (LCDType == LCD_SPFD5408))
  {
    /* Horizontal GRAM Start Address */
    if(Xpos >= Height)
    {
      LCD_WriteReg(LCD_REG_80, (Xpos - Height + 1));
    }
    else
    {
      LCD_WriteReg(LCD_REG_80, 0);
    }
    /* Horizontal GRAM End Address */
    LCD_WriteReg(LCD_REG_81, Xpos);
    /* Vertical GRAM Start Address */
    if(Ypos >= Width)
    {
      LCD_WriteReg(LCD_REG_82, (Ypos - Width + 1));
    }  
    else
    {
      LCD_WriteReg(LCD_REG_82, 0);
    }
    /* Vertical GRAM End Address */
    LCD_WriteReg(LCD_REG_83, Ypos);
  }
  else if(LCDType == LCD_HX8312)
  {  
    LCD_WriteReg(LCD_REG_1, 0xD0);
    LCD_WriteReg(LCD_REG_5, 0x14);
  
    LCD_WriteReg(LCD_REG_69, (Xpos - Height + 1));
    LCD_WriteReg(LCD_REG_70, Xpos);
 
    LCD_WriteReg(LCD_REG_71, (((Ypos - Width + 1) & 0x100)>> 8));
    LCD_WriteReg(LCD_REG_72, ((Ypos - Width + 1) & 0xFF));
    LCD_WriteReg(LCD_REG_73, ((Ypos & 0x100)>> 8));
    LCD_WriteReg(LCD_REG_74, (Ypos & 0xFF));
  }
  LCD_SetCursor(Xpos, Ypos);
}


/**
  * @brief  Disables LCD Window mode.
  * @param  None
  * @retval None
  */
void LCD_WindowModeDisable(void)
{
  if((LCDType == LCD_ILI9320) || (LCDType == LCD_SPFD5408))
  {
    LCD_SetDisplayWindow(239, 0x13F, 240, 320);
    LCD_WriteReg(LCD_REG_3, 0x1018);
  }
  else if(LCDType == LCD_HX8312)
  {
    LCD_WriteReg(LCD_REG_1, 0x50);
    LCD_WriteReg(LCD_REG_5, 0x04); 
  }
    
